# Pandas DataFrames-1

In [1]:
import numpy as np
import pandas as pd

In [5]:
df=pd.DataFrame(np.random.randn(20).reshape(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -1.537235 -0.429445  0.521749  0.980335
B  0.608497  0.192405 -1.149632 -0.507239
C -1.002821  0.126320 -1.903657 -0.466950
D -1.430325  0.850384 -0.263587  0.247358
E  1.247960  0.965895 -0.711860  0.068641

In [2]:
df=pd.DataFrame(np.arange(20).reshape(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [3]:
df['W'] # grabbing column

A     0
B     4
C     8
D    12
E    16
Name: W, dtype: int32

In [4]:
df.loc['A'] #Getting row

W    0
X    1
Y    2
Z    3
Name: A, dtype: int32

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
a=df.loc['A']
type(a)

pandas.core.series.Series

In [7]:
#gettin 18 from dataframe
# df.loc['E'][2]
# or
# df['Y'][4]
# or
df.iloc[4][2]

18

In [8]:
#getting two rows
df.loc[['A','B']]

   W  X  Y  Z
A  0  1  2  3
B  4  5  6  7

In [11]:
#getting two column
df[['W','X']]

    W   X
A   0   1
B   4   5
C   8   9
D  12  13
E  16  17

In [12]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [15]:
df.iloc[2] # using index position to get C row

W     8
X     9
Y    10
Z    11
Name: C, dtype: int32

In [13]:
df.iloc[1,3]

7

In [14]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [15]:
df.loc[['C','D'],['X','Y']]

    X   Y
C   9  10
D  13  14

In [16]:
df.iloc[[2,3],[1,2]]

    X   Y
C   9  10
D  13  14

In [17]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

In [18]:
df.reset_index()

  index   W   X   Y   Z
0     A   0   1   2   3
1     B   4   5   6   7
2     C   8   9  10  11
3     D  12  13  14  15
4     E  16  17  18  19

In [20]:
df

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15
E  16  17  18  19

# ADDING COLUMN

In [21]:
#

str='IN DI AI ML DL'.split(" ")
str

['IN', 'DI', 'AI', 'ML', 'DL']

In [25]:
df['str']=str

In [21]:
df

    W   X   Y   Z str
A   0   1   2   3  IN
B   4   5   6   7  DI
C   8   9  10  11  AI
D  12  13  14  15  ML
E  16  17  18  19  DL

# SETTING INDEX

In [34]:
df.set_index('str') #inorder to keep the change permanaent we will use inplace=True

      W   X   Y   Z
str
IN    0   1   2   3
DI    4   5   6   7
AI    8   9  10  11
ML   12  13  14  15
DL   16  17  18  19
DL   IN  DI  AI  ML

In [35]:
df

      W   X   Y   Z str
A     0   1   2   3  IN
B     4   5   6   7  DI
C     8   9  10  11  AI
D    12  13  14  15  ML
E    16  17  18  19  DL
str  IN  DI  AI  ML  DL

# Adding ROws

In [36]:
df.loc['str']=str

In [37]:
df

      W   X   Y   Z str
A     0   1   2   3  IN
B     4   5   6   7  DI
C     8   9  10  11  AI
D    12  13  14  15  ML
E    16  17  18  19  DL
str  IN  DI  AI  ML  DL

# Remove Columns

In [38]:
df

      W   X   Y   Z str
A     0   1   2   3  IN
B     4   5   6   7  DI
C     8   9  10  11  AI
D    12  13  14  15  ML
E    16  17  18  19  DL
str  IN  DI  AI  ML  DL

In [39]:
df.drop('Z',axis=1)

      W   X   Y str
A     0   1   2  IN
B     4   5   6  DI
C     8   9  10  AI
D    12  13  14  ML
E    16  17  18  DL
str  IN  DI  AI  DL

# REMOVE ROW

In [40]:
df.drop('str',inplace=True,axis=0)

In [41]:
df

    W   X   Y   Z str
A   0   1   2   3  IN
B   4   5   6   7  DI
C   8   9  10  11  AI
D  12  13  14  15  ML
E  16  17  18  19  DL

In [42]:
df[df['W']>0]

    W   X   Y   Z str
B   4   5   6   7  DI
C   8   9  10  11  AI
D  12  13  14  15  ML
E  16  17  18  19  DL

In [43]:
df[df['Y']>8]

    W   X   Y   Z str
C   8   9  10  11  AI
D  12  13  14  15  ML
E  16  17  18  19  DL

In [44]:
df[df['Y']<8 ]

   W  X  Y  Z str
A  0  1  2  3  IN
B  4  5  6  7  DI

In [45]:
df[(df['Y']>8) & (df['W']>8)]#Multiple conditions &-->and | for or

    W   X   Y   Z str
D  12  13  14  15  ML
E  16  17  18  19  DL

In [48]:
df[(df['Y']<8) | (df['W']>8)]

    W   X   Y   Z str
A   0   1   2   3  IN
B   4   5   6   7  DI
D  12  13  14  15  ML
E  16  17  18  19  DL

In [49]:
df

    W   X   Y   Z str
A   0   1   2   3  IN
B   4   5   6   7  DI
C   8   9  10  11  AI
D  12  13  14  15  ML
E  16  17  18  19  DL

In [52]:
df.loc[['C','D'],['Z','str']]

    Z str
C  11  AI
D  15  ML

In [53]:
str1='a r j u n'.split(" ")

In [54]:
str1

['a', 'r', 'j', 'u', 'n']

In [57]:
df.loc['nam']=str1

In [58]:
df['heroes']=['Thor','Hulk','Captain Marvel','Spider Man','Iron Man']
df.loc['heroes']=['Thor','Hulk','Captain Marvel','Spider Man','Iron Man','bat man']

In [62]:

df

           W     X               Y           Z       str          heroes
A          0     1               2           3        IN            Thor
B          4     5               6           7        DI            Hulk
C          8     9              10          11        AI  Captain Marvel
D         12    13              14          15        ML      Spider Man
E         16    17              18          19        DL        Iron Man
heroes  Thor  Hulk  Captain Marvel  Spider Man  Iron Man         bat man

In [68]:
df.drop(['heroes','E'],axis=0)

    W   X   Y   Z str          heroes
A   0   1   2   3  IN            Thor
B   4   5   6   7  DI            Hulk
C   8   9  10  11  AI  Captain Marvel
D  12  13  14  15  ML      Spider Man

In [69]:
df

           W     X               Y           Z       str          heroes
A          0     1               2           3        IN            Thor
B          4     5               6           7        DI            Hulk
C          8     9              10          11        AI  Captain Marvel
D         12    13              14          15        ML      Spider Man
E         16    17              18          19        DL        Iron Man
heroes  Thor  Hulk  Captain Marvel  Spider Man  Iron Man         bat man

# END